In [1]:
import pandas as pd

In [2]:
df = pd.read_csv('50_Startups.csv')

In [3]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 50 entries, 0 to 49
Data columns (total 6 columns):
R&D Spend          50 non-null float64
Administration     50 non-null float64
Marketing Spend    50 non-null float64
State              50 non-null object
Profit             50 non-null float64
Unnamed: 5         1 non-null float64
dtypes: float64(5), object(1)
memory usage: 2.4+ KB

In [4]:
df.head()

,R&D Spend,Administration,Marketing Spend,State,Profit,Unnamed: 5
0,165349.20,136897.80,471784.10,New York,192261.83,NaN
1,162597.70,151377.59,443898.53,California,191792.06,NaN
2,153441.51,101145.55,407934.54,Florida,191050.39,NaN
3,144372.41,118671.85,383199.62,New York,182901.99,NaN
4,142107.34,91391.77,366168.42,Florida,166187.94,NaN

In [5]:
#here we have column name state it is of string type 
#we have to convert it into number or depict state by a numbers
#this state column is a categorical variable
# we have to convert this categorical variable into dummy variable

In [6]:
state = df['State']

In [7]:
state

0       New York
1     California
2        Florida
3       New York
4        Florida
5       New York
6     California
7        Florida
8       New York
9     California
10       Florida
11    California
12       Florida
13    California
14       Florida
15      New York
16    California
17      New York
18       Florida
19      New York
20    California
21      New York
22       Florida
23       Florida
24      New York
25    California
26       Florida
27      New York
28       Florida
29      New York
30       Florida
31      New York
32    California
33       Florida
34    California
35      New York
36       Florida
37    California
38      New York
39    California
40    California
41       Florida
42    California
43      New York
44    California
45      New York
46       Florida
47    California
48      New York
49    California
Name: State, dtype: object

In [8]:
state_dummy = pd.get_dummies(state) #this is called one hot encoding

In [10]:
state_dummy.head()

   California  Florida  New York
0           0        0         1
1           1        0         0
2           0        1         0
3           0        0         1
4           0        1         0

In [11]:
state_dummy.shape

(50, 3)

In [12]:
#here these 3 columns California , Flo, Ny are not independent 
#this condition is called MUltiColinearity
#Multicollinearity refers to a situation in which two or more explanatory variables in a multiple regression model are highly linearly related. 
#bec of multi collinearity our program may stuck into loop and this condition is called DUMMY VARIABLE TRAP
#to overcome dummyvar trap we remove one of the three columns from state_dummy

In [13]:
state_dummy_update = state_dummy.iloc[:,0:2]

In [14]:
state_dummy_update.head() #now we have two independent columns

   California  Florida
0           0        0
1           1        0
2           0        1
3           0        0
4           0        1

In [25]:
state_dummy_update.columns

Index(['California', 'Florida'], dtype='object')

In [ ]:
#now we add this dummy_update in our final

In [28]:
x =df[['R&D Spend','Administration','Marketing Spend']]

In [30]:
x[['California', 'Florida']] = state_dummy_update 



#dierctway to add is below
#x=df[['R&D Spend','Administration','Marketing Spend','State']]
#x=pd.get_dummies(x, drop_first = True)---to drop column to remove dummyvar trap

C:\Users\user\Anaconda3\lib\site-packages\pandas\core\frame.py:3140: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  self[k1] = value[k2]

In [32]:
x.head()

   R&D Spend  Administration  Marketing Spend  California  Florida
0  165349.20       136897.80        471784.10           0        0
1  162597.70       151377.59        443898.53           1        0
2  153441.51       101145.55        407934.54           0        1
3  144372.41       118671.85        383199.62           0        0
4  142107.34        91391.77        366168.42           0        1

In [33]:
y = df['Profit']

In [34]:
y.head()

0    192261.83
1    191792.06
2    191050.39
3    182901.99
4    166187.94
Name: Profit, dtype: float64

In [35]:
from sklearn.linear_model import LinearRegression

In [36]:
lr = LinearRegression()

In [37]:
from sklearn.model_selection import train_test_split

In [38]:
x_train, x_test, y_train, y_test = train_test_split(x, y, test_size=0.33, random_state=42)

In [39]:
lr.fit(x_train, y_train)

LinearRegression(copy_X=True, fit_intercept=True, n_jobs=1, normalize=False)

In [40]:
lr.predict(x_test)

array([126187.35875892,  85719.45625047,  99648.03493262,  45664.95505306,
       127106.84248991,  51752.87494285, 109033.36185727, 100575.61410616,
        97877.86356679, 111674.70697829, 128750.98741824, 174097.59784015,
        93630.00362471, 148426.41941988, 172333.62606971, 155858.60922337,
        77089.61252311])

In [41]:
y_test

13    134307.35
39     81005.76
30     99937.59
45     64926.08
17    125370.37
48     35673.41
26    105733.54
25    107404.34
32     97427.84
19    122776.86
12    141585.52
4     166187.94
37     89949.14
8     152211.77
3     182901.99
6     156122.51
41     77798.83
Name: Profit, dtype: float64